HloModule jit_test_conv2d.1357

%body_computation.17 (parameter.18: (s32[], s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> (s32[], s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4]) {
  %constant.28 = pred[] constant(false)
  %parameter.18 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.19 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=0
  %constant.29 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.30 = s32[] add(s32[] %get-tuple-element.19, s32[] %constant.29), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.20 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=1
  %get-tuple-element.21 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=2
  %get-tuple-element.22 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=3
  %add.39 = u32[2]{0} add(u32[2]{0} %get-tuple-element.21, u32[2]{0} %get-tuple-element.22), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.26 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=7
  %slice.31 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.26), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.32 = u32[] reshape(u32[1]{0} %slice.31), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.40 = u32[2]{0} broadcast(u32[] %reshape.32), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.41 = u32[2]{0} shift-left(u32[2]{0} %get-tuple-element.22, u32[2]{0} %broadcast.40), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.42 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.43 = u32[] subtract(u32[] %constant.42, u32[] %reshape.32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.44 = u32[2]{0} broadcast(u32[] %subtract.43), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.45 = u32[2]{0} shift-right-logical(u32[2]{0} %get-tuple-element.22, u32[2]{0} %broadcast.44), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.46 = u32[2]{0} or(u32[2]{0} %shift-left.41, u32[2]{0} %shift-right-logical.45), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.47 = u32[2]{0} xor(u32[2]{0} %add.39, u32[2]{0} %or.46), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.48 = u32[2]{0} add(u32[2]{0} %add.39, u32[2]{0} %xor.47), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.33 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.26), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.34 = u32[] reshape(u32[1]{0} %slice.33), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.49 = u32[2]{0} broadcast(u32[] %reshape.34), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.50 = u32[2]{0} shift-left(u32[2]{0} %xor.47, u32[2]{0} %broadcast.49), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.51 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.52 = u32[] subtract(u32[] %constant.51, u32[] %reshape.34), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.53 = u32[2]{0} broadcast(u32[] %subtract.52), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.54 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.47, u32[2]{0} %broadcast.53), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.55 = u32[2]{0} or(u32[2]{0} %shift-left.50, u32[2]{0} %shift-right-logical.54), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.56 = u32[2]{0} xor(u32[2]{0} %add.48, u32[2]{0} %or.55), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.57 = u32[2]{0} add(u32[2]{0} %add.48, u32[2]{0} %xor.56), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.35 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.26), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.36 = u32[] reshape(u32[1]{0} %slice.35), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.58 = u32[2]{0} broadcast(u32[] %reshape.36), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.59 = u32[2]{0} shift-left(u32[2]{0} %xor.56, u32[2]{0} %broadcast.58), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.60 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.61 = u32[] subtract(u32[] %constant.60, u32[] %reshape.36), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.62 = u32[2]{0} broadcast(u32[] %subtract.61), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.63 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.56, u32[2]{0} %broadcast.62), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.64 = u32[2]{0} or(u32[2]{0} %shift-left.59, u32[2]{0} %shift-right-logical.63), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.65 = u32[2]{0} xor(u32[2]{0} %add.57, u32[2]{0} %or.64), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.66 = u32[2]{0} add(u32[2]{0} %add.57, u32[2]{0} %xor.65), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.23 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=4
  %broadcast.75 = u32[2]{0} broadcast(u32[] %get-tuple-element.23), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.76 = u32[2]{0} add(u32[2]{0} %add.66, u32[2]{0} %broadcast.75), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.37 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.26), slice={[3:4]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(4,)\n                  start_indices=(3,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.38 = u32[] reshape(u32[1]{0} %slice.37), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.67 = u32[2]{0} broadcast(u32[] %reshape.38), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.68 = u32[2]{0} shift-left(u32[2]{0} %xor.65, u32[2]{0} %broadcast.67), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.69 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.70 = u32[] subtract(u32[] %constant.69, u32[] %reshape.38), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.71 = u32[2]{0} broadcast(u32[] %subtract.70), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.72 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.65, u32[2]{0} %broadcast.71), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.73 = u32[2]{0} or(u32[2]{0} %shift-left.68, u32[2]{0} %shift-right-logical.72), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.74 = u32[2]{0} xor(u32[2]{0} %add.66, u32[2]{0} %or.73), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.24 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=5
  %broadcast.77 = u32[2]{0} broadcast(u32[] %get-tuple-element.24), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.78 = u32[2]{0} add(u32[2]{0} %xor.74, u32[2]{0} %broadcast.77), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.79 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.80 = s32[] add(s32[] %get-tuple-element.19, s32[] %constant.79), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %convert.81 = u32[] convert(s32[] %add.80), metadata={op_type="convert_element_type" op_name="while/body/convert_element_type[ new_dtype=uint32\n                                 old_dtype=int32 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.82 = u32[2]{0} broadcast(u32[] %convert.81), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.83 = u32[2]{0} add(u32[2]{0} %add.78, u32[2]{0} %broadcast.82), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.25 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=6
  %get-tuple-element.27 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.18), index=8
  ROOT %tuple.84 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %add.30, s32[] %get-tuple-element.20, u32[2]{0} %add.76, u32[2]{0} %add.83, u32[] %get-tuple-element.24, u32[] %get-tuple-element.25, u32[] %get-tuple-element.23, u32[4]{0} %get-tuple-element.27, u32[4]{0} %get-tuple-element.26)
}

%cond_computation.85 (parameter.86: (s32[], s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> pred[] {
  %parameter.86 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.89 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=2
  %get-tuple-element.90 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=3
  %get-tuple-element.91 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=4
  %get-tuple-element.92 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=5
  %get-tuple-element.93 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=6
  %get-tuple-element.94 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=7
  %get-tuple-element.95 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=8
  %constant.96 = pred[] constant(false)
  %get-tuple-element.87 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=0
  %get-tuple-element.88 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.86), index=1
  ROOT %compare.97 = pred[] compare(s32[] %get-tuple-element.87, s32[] %get-tuple-element.88), direction=LT, type=UNSIGNED, metadata={op_type="lt" op_name="while/cond/lt" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%jit_threefry_2x32.98 (parameter.99: u32[2], parameter.100: u32[4]) -> (u32[4]) {
  %constant.101 = pred[] constant(false)
  %constant.110 = pred[] constant(false), metadata={op_type="threefry2x32" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/threefry2x32" source_file="jax/jax_test_conv2d.py" source_line=24}
  %constant.118 = s32[] constant(0), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.119 = s32[] constant(5), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %parameter.100 = u32[4]{0} parameter(1)
  %slice.106 = u32[2]{0} slice(u32[4]{0} %parameter.100), slice={[0:2]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(2,)\n                                                       start_indices=(0,)\n                                                       strides=None ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %parameter.99 = u32[2]{0} parameter(0)
  %slice.102 = u32[1]{0} slice(u32[2]{0} %parameter.99), slice={[0:1]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(1,)\n                                                       start_indices=(0,)\n                                                       strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %reshape.103 = u32[] reshape(u32[1]{0} %slice.102), metadata={op_type="squeeze" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %broadcast.114 = u32[2]{0} broadcast(u32[] %reshape.103), dimensions={}, metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.115 = u32[2]{0} add(u32[2]{0} %slice.106, u32[2]{0} %broadcast.114), metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.107 = u32[2]{0} slice(u32[4]{0} %parameter.100), slice={[2:4]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(4,)\n                                                       start_indices=(2,)\n                                                       strides=None ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %slice.104 = u32[1]{0} slice(u32[2]{0} %parameter.99), slice={[1:2]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(2,)\n                                                       start_indices=(1,)\n                                                       strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %reshape.105 = u32[] reshape(u32[1]{0} %slice.104), metadata={op_type="squeeze" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %broadcast.116 = u32[2]{0} broadcast(u32[] %reshape.105), dimensions={}, metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.117 = u32[2]{0} add(u32[2]{0} %slice.107, u32[2]{0} %broadcast.116), metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.111 = u32[] xor(u32[] %reshape.103, u32[] %reshape.105), metadata={op_type="xor" op_name="xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.112 = u32[] constant(466688986), metadata={op_type="xor" op_name="xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.113 = u32[] xor(u32[] %xor.111, u32[] %constant.112), metadata={op_type="xor" op_name="xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.108 = u32[4]{0} constant({13, 15, 26, 6}), metadata={op_type="threefry2x32" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/threefry2x32" source_file="jax/jax_test_conv2d.py" source_line=24}
  %constant.109 = u32[4]{0} constant({17, 29, 16, 24}), metadata={op_type="threefry2x32" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/threefry2x32" source_file="jax/jax_test_conv2d.py" source_line=24}
  %tuple.120 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %constant.118, s32[] %constant.119, u32[2]{0} %add.115, u32[2]{0} %add.117, u32[] %reshape.105, u32[] %xor.113, u32[] %reshape.103, u32[4]{0} %constant.108, u32[4]{0} %constant.109), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %while.121 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) while((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.120), condition=%cond_computation.85, body=%body_computation.17, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.122 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=0, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.123 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=1, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.124 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=2, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.125 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=3, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.126 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=4, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.127 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=5, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.128 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=6, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.129 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=7, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.130 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.121), index=8, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %tuple.131 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %get-tuple-element.122, s32[] %get-tuple-element.123, u32[2]{0} %get-tuple-element.124, u32[2]{0} %get-tuple-element.125, u32[] %get-tuple-element.126, u32[] %get-tuple-element.127, u32[] %get-tuple-element.128, u32[4]{0} %get-tuple-element.129, u32[4]{0} %get-tuple-element.130), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.132 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=0, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.133 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=1, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.136 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=4, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.137 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=5, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.138 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=6, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.139 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=7, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.140 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=8, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.134 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=2, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.135 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.131), index=3, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %tuple.141 = (u32[2]{0}, u32[2]{0}) tuple(u32[2]{0} %get-tuple-element.134, u32[2]{0} %get-tuple-element.135)
  %get-tuple-element.142 = u32[2]{0} get-tuple-element((u32[2]{0}, u32[2]{0}) %tuple.141), index=0
  %get-tuple-element.143 = u32[2]{0} get-tuple-element((u32[2]{0}, u32[2]{0}) %tuple.141), index=1
  %concatenate.144 = u32[4]{0} concatenate(u32[2]{0} %get-tuple-element.142, u32[2]{0} %get-tuple-element.143), dimensions={0}, metadata={op_type="concatenate" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/concatenate[ dimension=0 ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  ROOT %tuple.145 = (u32[4]{0}) tuple(u32[4]{0} %concatenate.144)
}

%jit__split.146 (parameter.147: u32[4], parameter.148: u32[2]) -> (u32[2,2]) {
  %constant.149 = pred[] constant(false)
  %parameter.148 = u32[2]{0} parameter(1)
  %parameter.147 = u32[4]{0} parameter(0)
  %call.150 = (u32[4]{0}) call(u32[2]{0} %parameter.148, u32[4]{0} %parameter.147), to_apply=%jit_threefry_2x32.98, metadata={op_type="xla_call" op_name="jit(test_conv2d)/jit(_split)/xla_call[ backend=None\n                                       device=None\n                                       donated_invars=(False, False)\n                                       name=threefry_2x32 ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %get-tuple-element.151 = u32[4]{0} get-tuple-element((u32[4]{0}) %call.150), index=0, metadata={op_type="xla_call" op_name="jit(test_conv2d)/jit(_split)/xla_call[ backend=None\n                                       device=None\n                                       donated_invars=(False, False)\n                                       name=threefry_2x32 ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %reshape.152 = u32[2,2]{1,0} reshape(u32[4]{0} %get-tuple-element.151), metadata={op_type="reshape" op_name="jit(test_conv2d)/jit(_split)/reshape[ dimensions=None\n                                      new_sizes=(2, 2) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  ROOT %tuple.153 = (u32[2,2]{1,0}) tuple(u32[2,2]{1,0} %reshape.152)
}

%body_computation__1.160 (parameter.161: (s32[], s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> (s32[], s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4]) {
  %constant.171 = pred[] constant(false)
  %parameter.161 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.162 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=0
  %constant.172 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.173 = s32[] add(s32[] %get-tuple-element.162, s32[] %constant.172), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.163 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=1
  %get-tuple-element.164 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=2
  %get-tuple-element.165 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=3
  %add.182 = u32[2]{0} add(u32[2]{0} %get-tuple-element.164, u32[2]{0} %get-tuple-element.165), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.169 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=7
  %slice.174 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.169), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.175 = u32[] reshape(u32[1]{0} %slice.174), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.183 = u32[2]{0} broadcast(u32[] %reshape.175), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.184 = u32[2]{0} shift-left(u32[2]{0} %get-tuple-element.165, u32[2]{0} %broadcast.183), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.185 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.186 = u32[] subtract(u32[] %constant.185, u32[] %reshape.175), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.187 = u32[2]{0} broadcast(u32[] %subtract.186), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.188 = u32[2]{0} shift-right-logical(u32[2]{0} %get-tuple-element.165, u32[2]{0} %broadcast.187), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.189 = u32[2]{0} or(u32[2]{0} %shift-left.184, u32[2]{0} %shift-right-logical.188), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.190 = u32[2]{0} xor(u32[2]{0} %add.182, u32[2]{0} %or.189), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.191 = u32[2]{0} add(u32[2]{0} %add.182, u32[2]{0} %xor.190), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.176 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.169), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.177 = u32[] reshape(u32[1]{0} %slice.176), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.192 = u32[2]{0} broadcast(u32[] %reshape.177), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.193 = u32[2]{0} shift-left(u32[2]{0} %xor.190, u32[2]{0} %broadcast.192), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.194 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.195 = u32[] subtract(u32[] %constant.194, u32[] %reshape.177), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.196 = u32[2]{0} broadcast(u32[] %subtract.195), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.197 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.190, u32[2]{0} %broadcast.196), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.198 = u32[2]{0} or(u32[2]{0} %shift-left.193, u32[2]{0} %shift-right-logical.197), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.199 = u32[2]{0} xor(u32[2]{0} %add.191, u32[2]{0} %or.198), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.200 = u32[2]{0} add(u32[2]{0} %add.191, u32[2]{0} %xor.199), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.178 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.169), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.179 = u32[] reshape(u32[1]{0} %slice.178), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.201 = u32[2]{0} broadcast(u32[] %reshape.179), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.202 = u32[2]{0} shift-left(u32[2]{0} %xor.199, u32[2]{0} %broadcast.201), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.203 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.204 = u32[] subtract(u32[] %constant.203, u32[] %reshape.179), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.205 = u32[2]{0} broadcast(u32[] %subtract.204), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.206 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.199, u32[2]{0} %broadcast.205), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.207 = u32[2]{0} or(u32[2]{0} %shift-left.202, u32[2]{0} %shift-right-logical.206), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.208 = u32[2]{0} xor(u32[2]{0} %add.200, u32[2]{0} %or.207), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.209 = u32[2]{0} add(u32[2]{0} %add.200, u32[2]{0} %xor.208), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.166 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=4
  %broadcast.218 = u32[2]{0} broadcast(u32[] %get-tuple-element.166), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.219 = u32[2]{0} add(u32[2]{0} %add.209, u32[2]{0} %broadcast.218), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.180 = u32[1]{0} slice(u32[4]{0} %get-tuple-element.169), slice={[3:4]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(4,)\n                  start_indices=(3,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.181 = u32[] reshape(u32[1]{0} %slice.180), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.210 = u32[2]{0} broadcast(u32[] %reshape.181), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.211 = u32[2]{0} shift-left(u32[2]{0} %xor.208, u32[2]{0} %broadcast.210), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.212 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.213 = u32[] subtract(u32[] %constant.212, u32[] %reshape.181), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.214 = u32[2]{0} broadcast(u32[] %subtract.213), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.215 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.208, u32[2]{0} %broadcast.214), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.216 = u32[2]{0} or(u32[2]{0} %shift-left.211, u32[2]{0} %shift-right-logical.215), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.217 = u32[2]{0} xor(u32[2]{0} %add.209, u32[2]{0} %or.216), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.167 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=5
  %broadcast.220 = u32[2]{0} broadcast(u32[] %get-tuple-element.167), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.221 = u32[2]{0} add(u32[2]{0} %xor.217, u32[2]{0} %broadcast.220), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.222 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.223 = s32[] add(s32[] %get-tuple-element.162, s32[] %constant.222), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %convert.224 = u32[] convert(s32[] %add.223), metadata={op_type="convert_element_type" op_name="while/body/convert_element_type[ new_dtype=uint32\n                                 old_dtype=int32 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.225 = u32[2]{0} broadcast(u32[] %convert.224), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.226 = u32[2]{0} add(u32[2]{0} %add.221, u32[2]{0} %broadcast.225), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.168 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=6
  %get-tuple-element.170 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.161), index=8
  ROOT %tuple.227 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %add.173, s32[] %get-tuple-element.163, u32[2]{0} %add.219, u32[2]{0} %add.226, u32[] %get-tuple-element.167, u32[] %get-tuple-element.168, u32[] %get-tuple-element.166, u32[4]{0} %get-tuple-element.170, u32[4]{0} %get-tuple-element.169)
}

%cond_computation__1.228 (parameter.229: (s32[], s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> pred[] {
  %parameter.229 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.232 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=2
  %get-tuple-element.233 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=3
  %get-tuple-element.234 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=4
  %get-tuple-element.235 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=5
  %get-tuple-element.236 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=6
  %get-tuple-element.237 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=7
  %get-tuple-element.238 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=8
  %constant.239 = pred[] constant(false)
  %get-tuple-element.230 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=0
  %get-tuple-element.231 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.229), index=1
  ROOT %compare.240 = pred[] compare(s32[] %get-tuple-element.230, s32[] %get-tuple-element.231), direction=LT, type=UNSIGNED, metadata={op_type="lt" op_name="while/cond/lt" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%jit_threefry_2x32__1.241 (parameter.242: u32[2], parameter.243: u32[4]) -> (u32[4]) {
  %constant.244 = pred[] constant(false)
  %constant.253 = pred[] constant(false), metadata={op_type="threefry2x32" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/threefry2x32" source_file="jax/jax_test_conv2d.py" source_line=24}
  %constant.261 = s32[] constant(0), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.262 = s32[] constant(5), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %parameter.243 = u32[4]{0} parameter(1)
  %slice.249 = u32[2]{0} slice(u32[4]{0} %parameter.243), slice={[0:2]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(2,)\n                                                       start_indices=(0,)\n                                                       strides=None ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %parameter.242 = u32[2]{0} parameter(0)
  %slice.245 = u32[1]{0} slice(u32[2]{0} %parameter.242), slice={[0:1]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(1,)\n                                                       start_indices=(0,)\n                                                       strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %reshape.246 = u32[] reshape(u32[1]{0} %slice.245), metadata={op_type="squeeze" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %broadcast.257 = u32[2]{0} broadcast(u32[] %reshape.246), dimensions={}, metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.258 = u32[2]{0} add(u32[2]{0} %slice.249, u32[2]{0} %broadcast.257), metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.250 = u32[2]{0} slice(u32[4]{0} %parameter.243), slice={[2:4]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(4,)\n                                                       start_indices=(2,)\n                                                       strides=None ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %slice.247 = u32[1]{0} slice(u32[2]{0} %parameter.242), slice={[1:2]}, metadata={op_type="slice" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/slice[ limit_indices=(2,)\n                                                       start_indices=(1,)\n                                                       strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %reshape.248 = u32[] reshape(u32[1]{0} %slice.247), metadata={op_type="squeeze" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=24}
  %broadcast.259 = u32[2]{0} broadcast(u32[] %reshape.248), dimensions={}, metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.260 = u32[2]{0} add(u32[2]{0} %slice.250, u32[2]{0} %broadcast.259), metadata={op_type="add" op_name="add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.254 = u32[] xor(u32[] %reshape.246, u32[] %reshape.248), metadata={op_type="xor" op_name="xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.255 = u32[] constant(466688986), metadata={op_type="xor" op_name="xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.256 = u32[] xor(u32[] %xor.254, u32[] %constant.255), metadata={op_type="xor" op_name="xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.251 = u32[4]{0} constant({13, 15, 26, 6}), metadata={op_type="threefry2x32" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/threefry2x32" source_file="jax/jax_test_conv2d.py" source_line=24}
  %constant.252 = u32[4]{0} constant({17, 29, 16, 24}), metadata={op_type="threefry2x32" op_name="jit(test_conv2d)/jit(_split)/jit(threefry_2x32)/threefry2x32" source_file="jax/jax_test_conv2d.py" source_line=24}
  %tuple.263 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %constant.261, s32[] %constant.262, u32[2]{0} %add.258, u32[2]{0} %add.260, u32[] %reshape.248, u32[] %xor.256, u32[] %reshape.246, u32[4]{0} %constant.251, u32[4]{0} %constant.252), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %while.264 = (s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) while((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %tuple.263), condition=%cond_computation__1.228, body=%body_computation__1.160, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.265 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=0, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.266 = s32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=1, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.267 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=2, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.268 = u32[2]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=3, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.269 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=4, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.270 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=5, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.271 = u32[] get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=6, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.272 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=7, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.273 = u32[4]{0} get-tuple-element((s32[], s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %while.264), index=8, metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
