HloModule jit_test_conv2d.1357

%fused_computation (param_0.2: u32[], param_1.5: u32[4], param_2.6: u32[2], param_3.7: u32[2], param_4.12: s32[]) -> u32[2] {
  %param_3.7 = u32[2]{0} parameter(3)
  %param_2.6 = u32[2]{0} parameter(2)
  %add.161 = u32[2]{0} add(u32[2]{0} %param_3.7, u32[2]{0} %param_2.6), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_1.5 = u32[4]{0} parameter(1)
  %slice.85 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.108 = u32[] reshape(u32[1]{0} %slice.85), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.211 = u32[2]{0} broadcast(u32[] %reshape.108), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.19 = u32[2]{0} shift-left(u32[2]{0} %param_2.6, u32[2]{0} %broadcast.211), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.547 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.36 = u32[] subtract(u32[] %constant.547, u32[] %reshape.108), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.209 = u32[2]{0} broadcast(u32[] %subtract.36), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.25 = u32[2]{0} shift-right-logical(u32[2]{0} %param_2.6, u32[2]{0} %broadcast.209), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.25 = u32[2]{0} or(u32[2]{0} %shift-left.19, u32[2]{0} %shift-right-logical.25), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.48 = u32[2]{0} xor(u32[2]{0} %add.161, u32[2]{0} %or.25), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.160 = u32[2]{0} add(u32[2]{0} %add.161, u32[2]{0} %xor.48), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.84 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.107 = u32[] reshape(u32[1]{0} %slice.84), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.208 = u32[2]{0} broadcast(u32[] %reshape.107), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.18 = u32[2]{0} shift-left(u32[2]{0} %xor.48, u32[2]{0} %broadcast.208), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.35 = u32[] subtract(u32[] %constant.547, u32[] %reshape.107), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.207 = u32[2]{0} broadcast(u32[] %subtract.35), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.24 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.48, u32[2]{0} %broadcast.207), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.24 = u32[2]{0} or(u32[2]{0} %shift-left.18, u32[2]{0} %shift-right-logical.24), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.46 = u32[2]{0} xor(u32[2]{0} %add.160, u32[2]{0} %or.24), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.159 = u32[2]{0} add(u32[2]{0} %add.160, u32[2]{0} %xor.46), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.83 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.106 = u32[] reshape(u32[1]{0} %slice.83), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.206 = u32[2]{0} broadcast(u32[] %reshape.106), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.17 = u32[2]{0} shift-left(u32[2]{0} %xor.46, u32[2]{0} %broadcast.206), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.34 = u32[] subtract(u32[] %constant.547, u32[] %reshape.106), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.204 = u32[2]{0} broadcast(u32[] %subtract.34), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.23 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.46, u32[2]{0} %broadcast.204), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.23 = u32[2]{0} or(u32[2]{0} %shift-left.17, u32[2]{0} %shift-right-logical.23), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.45 = u32[2]{0} xor(u32[2]{0} %add.159, u32[2]{0} %or.23), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.158 = u32[2]{0} add(u32[2]{0} %add.159, u32[2]{0} %xor.45), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.82 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[3:4]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(4,)\n                  start_indices=(3,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.104 = u32[] reshape(u32[1]{0} %slice.82), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.203 = u32[2]{0} broadcast(u32[] %reshape.104), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.16 = u32[2]{0} shift-left(u32[2]{0} %xor.45, u32[2]{0} %broadcast.203), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.33 = u32[] subtract(u32[] %constant.547, u32[] %reshape.104), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.202 = u32[2]{0} broadcast(u32[] %subtract.33), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.22 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.45, u32[2]{0} %broadcast.202), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.22 = u32[2]{0} or(u32[2]{0} %shift-left.16, u32[2]{0} %shift-right-logical.22), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.44 = u32[2]{0} xor(u32[2]{0} %add.158, u32[2]{0} %or.22), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_0.2 = u32[] parameter(0)
  %broadcast.200 = u32[2]{0} broadcast(u32[] %param_0.2), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.157 = u32[2]{0} add(u32[2]{0} %xor.44, u32[2]{0} %broadcast.200), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_4.12 = s32[] parameter(4)
  %constant.548 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.162 = s32[] add(s32[] %param_4.12, s32[] %constant.548), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %convert.6 = u32[] convert(s32[] %add.162), metadata={op_type="convert_element_type" op_name="while/body/convert_element_type[ new_dtype=uint32\n                                 old_dtype=int32 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.199 = u32[2]{0} broadcast(u32[] %convert.6), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  ROOT %add.156 = u32[2]{0} add(u32[2]{0} %add.157, u32[2]{0} %broadcast.199), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%fused_computation.1 (param_0.4: u32[], param_1.11: u32[4], param_2.14: u32[2], param_3.17: u32[2]) -> u32[2] {
  %param_3.17 = u32[2]{0} parameter(3)
  %param_2.14 = u32[2]{0} parameter(2)
  %add.167 = u32[2]{0} add(u32[2]{0} %param_3.17, u32[2]{0} %param_2.14), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_1.11 = u32[4]{0} parameter(1)
  %slice.88 = u32[1]{0} slice(u32[4]{0} %param_1.11), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.111 = u32[] reshape(u32[1]{0} %slice.88), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.221 = u32[2]{0} broadcast(u32[] %reshape.111), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.22 = u32[2]{0} shift-left(u32[2]{0} %param_2.14, u32[2]{0} %broadcast.221), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.550 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.39 = u32[] subtract(u32[] %constant.550, u32[] %reshape.111), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.219 = u32[2]{0} broadcast(u32[] %subtract.39), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.28 = u32[2]{0} shift-right-logical(u32[2]{0} %param_2.14, u32[2]{0} %broadcast.219), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.28 = u32[2]{0} or(u32[2]{0} %shift-left.22, u32[2]{0} %shift-right-logical.28), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.51 = u32[2]{0} xor(u32[2]{0} %add.167, u32[2]{0} %or.28), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.166 = u32[2]{0} add(u32[2]{0} %add.167, u32[2]{0} %xor.51), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.87 = u32[1]{0} slice(u32[4]{0} %param_1.11), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.110 = u32[] reshape(u32[1]{0} %slice.87), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.217 = u32[2]{0} broadcast(u32[] %reshape.110), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.21 = u32[2]{0} shift-left(u32[2]{0} %xor.51, u32[2]{0} %broadcast.217), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.38 = u32[] subtract(u32[] %constant.550, u32[] %reshape.110), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.216 = u32[2]{0} broadcast(u32[] %subtract.38), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.27 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.51, u32[2]{0} %broadcast.216), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.27 = u32[2]{0} or(u32[2]{0} %shift-left.21, u32[2]{0} %shift-right-logical.27), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.50 = u32[2]{0} xor(u32[2]{0} %add.166, u32[2]{0} %or.27), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.165 = u32[2]{0} add(u32[2]{0} %add.166, u32[2]{0} %xor.50), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.86 = u32[1]{0} slice(u32[4]{0} %param_1.11), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.109 = u32[] reshape(u32[1]{0} %slice.86), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.215 = u32[2]{0} broadcast(u32[] %reshape.109), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.20 = u32[2]{0} shift-left(u32[2]{0} %xor.50, u32[2]{0} %broadcast.215), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.37 = u32[] subtract(u32[] %constant.550, u32[] %reshape.109), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.213 = u32[2]{0} broadcast(u32[] %subtract.37), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.26 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.50, u32[2]{0} %broadcast.213), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.26 = u32[2]{0} or(u32[2]{0} %shift-left.20, u32[2]{0} %shift-right-logical.26), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.49 = u32[2]{0} xor(u32[2]{0} %add.165, u32[2]{0} %or.26), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.164 = u32[2]{0} add(u32[2]{0} %add.165, u32[2]{0} %xor.49), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_0.4 = u32[] parameter(0)
  %broadcast.212 = u32[2]{0} broadcast(u32[] %param_0.4), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  ROOT %add.163 = u32[2]{0} add(u32[2]{0} %add.164, u32[2]{0} %broadcast.212), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%body_computation.17.clone (parameter.1: (s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> (s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4]) {
  %parameter.1 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.621 = s32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=0
  %copy.8 = s32[] copy(s32[] %get-tuple-element.621)
  %constant.286 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.112 = s32[] add(s32[] %copy.8, s32[] %constant.286), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.624 = u32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=3
  %copy.11 = u32[] copy(u32[] %get-tuple-element.624)
  %get-tuple-element.627 = u32[4]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=6
  %copy.14 = u32[4]{0} copy(u32[4]{0} %get-tuple-element.627)
  %get-tuple-element.623 = u32[2]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=2
  %copy.10 = u32[2]{0} copy(u32[2]{0} %get-tuple-element.623)
  %get-tuple-element.622 = u32[2]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=1
  %copy.9 = u32[2]{0} copy(u32[2]{0} %get-tuple-element.622)
  %fusion.1 = u32[2]{0} fusion(u32[] %copy.11, u32[4]{0} %copy.14, u32[2]{0} %copy.10, u32[2]{0} %copy.9), kind=kLoop, calls=%fused_computation.1, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.625 = u32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=4
  %copy.12 = u32[] copy(u32[] %get-tuple-element.625)
  %fusion = u32[2]{0} fusion(u32[] %copy.12, u32[4]{0} %copy.14, u32[2]{0} %copy.10, u32[2]{0} %copy.9, s32[] %copy.8), kind=kLoop, calls=%fused_computation, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %copy.19 = u32[] copy(u32[] %copy.12), control-predecessors={%copy.11}
  %get-tuple-element.626 = u32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=5
  %copy.13 = u32[] copy(u32[] %get-tuple-element.626)
  %copy.20 = u32[] copy(u32[] %copy.13), control-predecessors={%copy.12}
  %copy.21 = u32[] copy(u32[] %copy.11), control-predecessors={%copy.13}
  %get-tuple-element.628 = u32[4]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.1), index=7
  %copy.15 = u32[4]{0} copy(u32[4]{0} %get-tuple-element.628)
  %copy.22 = u32[4]{0} copy(u32[4]{0} %copy.15), control-predecessors={%copy.14}
  %copy.23 = u32[4]{0} copy(u32[4]{0} %copy.14), control-predecessors={%copy.15}
  ROOT %tuple.93 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %add.112, u32[2]{0} %fusion.1, u32[2]{0} %fusion, u32[] %copy.19, u32[] %copy.20, u32[] %copy.21, u32[4]{0} %copy.22, u32[4]{0} %copy.23)
}

%cond_computation.85.clone (parameter.0: (s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> pred[] {
  %parameter.0 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.395 = s32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.0), index=0
  %constant.283 = s32[] constant(5), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  ROOT %compare.12 = pred[] compare(s32[] %get-tuple-element.395, s32[] %constant.283), direction=LT, type=UNSIGNED, metadata={op_type="lt" op_name="while/cond/lt" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%fused_computation.2 (param_0.7: u32[], param_1.17: u32[4], param_2.21: u32[2], param_3.25: u32[2], param_4.41: s32[]) -> u32[2] {
  %param_3.25 = u32[2]{0} parameter(3)
  %param_2.21 = u32[2]{0} parameter(2)
  %add.174 = u32[2]{0} add(u32[2]{0} %param_3.25, u32[2]{0} %param_2.21), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_1.17 = u32[4]{0} parameter(1)
  %slice.92 = u32[1]{0} slice(u32[4]{0} %param_1.17), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.115 = u32[] reshape(u32[1]{0} %slice.92), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.232 = u32[2]{0} broadcast(u32[] %reshape.115), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.26 = u32[2]{0} shift-left(u32[2]{0} %param_2.21, u32[2]{0} %broadcast.232), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.551 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.44 = u32[] subtract(u32[] %constant.551, u32[] %reshape.115), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.231 = u32[2]{0} broadcast(u32[] %subtract.44), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.32 = u32[2]{0} shift-right-logical(u32[2]{0} %param_2.21, u32[2]{0} %broadcast.231), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.32 = u32[2]{0} or(u32[2]{0} %shift-left.26, u32[2]{0} %shift-right-logical.32), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.55 = u32[2]{0} xor(u32[2]{0} %add.174, u32[2]{0} %or.32), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.172 = u32[2]{0} add(u32[2]{0} %add.174, u32[2]{0} %xor.55), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.91 = u32[1]{0} slice(u32[4]{0} %param_1.17), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.114 = u32[] reshape(u32[1]{0} %slice.91), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.230 = u32[2]{0} broadcast(u32[] %reshape.114), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.25 = u32[2]{0} shift-left(u32[2]{0} %xor.55, u32[2]{0} %broadcast.230), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.42 = u32[] subtract(u32[] %constant.551, u32[] %reshape.114), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.229 = u32[2]{0} broadcast(u32[] %subtract.42), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.31 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.55, u32[2]{0} %broadcast.229), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.31 = u32[2]{0} or(u32[2]{0} %shift-left.25, u32[2]{0} %shift-right-logical.31), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.54 = u32[2]{0} xor(u32[2]{0} %add.172, u32[2]{0} %or.31), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.171 = u32[2]{0} add(u32[2]{0} %add.172, u32[2]{0} %xor.54), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.90 = u32[1]{0} slice(u32[4]{0} %param_1.17), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.113 = u32[] reshape(u32[1]{0} %slice.90), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.228 = u32[2]{0} broadcast(u32[] %reshape.113), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.24 = u32[2]{0} shift-left(u32[2]{0} %xor.54, u32[2]{0} %broadcast.228), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.41 = u32[] subtract(u32[] %constant.551, u32[] %reshape.113), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.227 = u32[2]{0} broadcast(u32[] %subtract.41), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.30 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.54, u32[2]{0} %broadcast.227), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.30 = u32[2]{0} or(u32[2]{0} %shift-left.24, u32[2]{0} %shift-right-logical.30), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.53 = u32[2]{0} xor(u32[2]{0} %add.171, u32[2]{0} %or.30), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.170 = u32[2]{0} add(u32[2]{0} %add.171, u32[2]{0} %xor.53), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.89 = u32[1]{0} slice(u32[4]{0} %param_1.17), slice={[3:4]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(4,)\n                  start_indices=(3,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.112 = u32[] reshape(u32[1]{0} %slice.89), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.226 = u32[2]{0} broadcast(u32[] %reshape.112), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.23 = u32[2]{0} shift-left(u32[2]{0} %xor.53, u32[2]{0} %broadcast.226), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.40 = u32[] subtract(u32[] %constant.551, u32[] %reshape.112), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.224 = u32[2]{0} broadcast(u32[] %subtract.40), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.29 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.53, u32[2]{0} %broadcast.224), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.29 = u32[2]{0} or(u32[2]{0} %shift-left.23, u32[2]{0} %shift-right-logical.29), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.52 = u32[2]{0} xor(u32[2]{0} %add.170, u32[2]{0} %or.29), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_0.7 = u32[] parameter(0)
  %broadcast.223 = u32[2]{0} broadcast(u32[] %param_0.7), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.169 = u32[2]{0} add(u32[2]{0} %xor.52, u32[2]{0} %broadcast.223), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_4.41 = s32[] parameter(4)
  %constant.553 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.175 = s32[] add(s32[] %param_4.41, s32[] %constant.553), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %convert.7 = u32[] convert(s32[] %add.175), metadata={op_type="convert_element_type" op_name="while/body/convert_element_type[ new_dtype=uint32\n                                 old_dtype=int32 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.222 = u32[2]{0} broadcast(u32[] %convert.7), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  ROOT %add.168 = u32[2]{0} add(u32[2]{0} %add.169, u32[2]{0} %broadcast.222), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%fused_computation.3 (param_0.9: u32[], param_1.23: u32[4], param_2.29: u32[2], param_3.35: u32[2]) -> u32[2] {
  %param_3.35 = u32[2]{0} parameter(3)
  %param_2.29 = u32[2]{0} parameter(2)
  %add.180 = u32[2]{0} add(u32[2]{0} %param_3.35, u32[2]{0} %param_2.29), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_1.23 = u32[4]{0} parameter(1)
  %slice.95 = u32[1]{0} slice(u32[4]{0} %param_1.23), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.118 = u32[] reshape(u32[1]{0} %slice.95), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.239 = u32[2]{0} broadcast(u32[] %reshape.118), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.29 = u32[2]{0} shift-left(u32[2]{0} %param_2.29, u32[2]{0} %broadcast.239), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.554 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.47 = u32[] subtract(u32[] %constant.554, u32[] %reshape.118), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.238 = u32[2]{0} broadcast(u32[] %subtract.47), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.35 = u32[2]{0} shift-right-logical(u32[2]{0} %param_2.29, u32[2]{0} %broadcast.238), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.35 = u32[2]{0} or(u32[2]{0} %shift-left.29, u32[2]{0} %shift-right-logical.35), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.59 = u32[2]{0} xor(u32[2]{0} %add.180, u32[2]{0} %or.35), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.179 = u32[2]{0} add(u32[2]{0} %add.180, u32[2]{0} %xor.59), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.94 = u32[1]{0} slice(u32[4]{0} %param_1.23), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.117 = u32[] reshape(u32[1]{0} %slice.94), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.237 = u32[2]{0} broadcast(u32[] %reshape.117), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.28 = u32[2]{0} shift-left(u32[2]{0} %xor.59, u32[2]{0} %broadcast.237), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.46 = u32[] subtract(u32[] %constant.554, u32[] %reshape.117), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.236 = u32[2]{0} broadcast(u32[] %subtract.46), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.34 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.59, u32[2]{0} %broadcast.236), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.34 = u32[2]{0} or(u32[2]{0} %shift-left.28, u32[2]{0} %shift-right-logical.34), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.58 = u32[2]{0} xor(u32[2]{0} %add.179, u32[2]{0} %or.34), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.178 = u32[2]{0} add(u32[2]{0} %add.179, u32[2]{0} %xor.58), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.93 = u32[1]{0} slice(u32[4]{0} %param_1.23), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.116 = u32[] reshape(u32[1]{0} %slice.93), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.235 = u32[2]{0} broadcast(u32[] %reshape.116), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.27 = u32[2]{0} shift-left(u32[2]{0} %xor.58, u32[2]{0} %broadcast.235), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.45 = u32[] subtract(u32[] %constant.554, u32[] %reshape.116), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.234 = u32[2]{0} broadcast(u32[] %subtract.45), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.33 = u32[2]{0} shift-right-logical(u32[2]{0} %xor.58, u32[2]{0} %broadcast.234), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.33 = u32[2]{0} or(u32[2]{0} %shift-left.27, u32[2]{0} %shift-right-logical.33), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.57 = u32[2]{0} xor(u32[2]{0} %add.178, u32[2]{0} %or.33), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.177 = u32[2]{0} add(u32[2]{0} %add.178, u32[2]{0} %xor.57), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_0.9 = u32[] parameter(0)
  %broadcast.233 = u32[2]{0} broadcast(u32[] %param_0.9), dimensions={}, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  ROOT %add.176 = u32[2]{0} add(u32[2]{0} %add.177, u32[2]{0} %broadcast.233), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%body_computation__1.160.clone (parameter.3: (s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> (s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4]) {
  %parameter.3 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.645 = s32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=0
  %copy.32 = s32[] copy(s32[] %get-tuple-element.645)
  %constant.298 = s32[] constant(1), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.123 = s32[] add(s32[] %copy.32, s32[] %constant.298), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.648 = u32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=3
  %copy.35 = u32[] copy(u32[] %get-tuple-element.648)
  %get-tuple-element.651 = u32[4]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=6
  %copy.38 = u32[4]{0} copy(u32[4]{0} %get-tuple-element.651)
  %get-tuple-element.647 = u32[2]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=2
  %copy.34 = u32[2]{0} copy(u32[2]{0} %get-tuple-element.647)
  %get-tuple-element.646 = u32[2]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=1
  %copy.33 = u32[2]{0} copy(u32[2]{0} %get-tuple-element.646)
  %fusion.3 = u32[2]{0} fusion(u32[] %copy.35, u32[4]{0} %copy.38, u32[2]{0} %copy.34, u32[2]{0} %copy.33), kind=kLoop, calls=%fused_computation.3, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %get-tuple-element.649 = u32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=4
  %copy.36 = u32[] copy(u32[] %get-tuple-element.649)
  %fusion.2 = u32[2]{0} fusion(u32[] %copy.36, u32[4]{0} %copy.38, u32[2]{0} %copy.34, u32[2]{0} %copy.33, s32[] %copy.32), kind=kLoop, calls=%fused_computation.2, metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %copy.43 = u32[] copy(u32[] %copy.36), control-predecessors={%copy.35}
  %get-tuple-element.650 = u32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=5
  %copy.37 = u32[] copy(u32[] %get-tuple-element.650)
  %copy.44 = u32[] copy(u32[] %copy.37), control-predecessors={%copy.36}
  %copy.45 = u32[] copy(u32[] %copy.35), control-predecessors={%copy.37}
  %get-tuple-element.652 = u32[4]{0} get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.3), index=7
  %copy.39 = u32[4]{0} copy(u32[4]{0} %get-tuple-element.652)
  %copy.46 = u32[4]{0} copy(u32[4]{0} %copy.39), control-predecessors={%copy.38}
  %copy.47 = u32[4]{0} copy(u32[4]{0} %copy.38), control-predecessors={%copy.39}
  ROOT %tuple.96 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) tuple(s32[] %add.123, u32[2]{0} %fusion.3, u32[2]{0} %fusion.2, u32[] %copy.43, u32[] %copy.44, u32[] %copy.45, u32[4]{0} %copy.46, u32[4]{0} %copy.47)
}

%cond_computation__1.228.clone (parameter.2: (s32[], u32[2], u32[2], u32[], u32[], u32[], u32[4], u32[4])) -> pred[] {
  %parameter.2 = (s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.467 = s32[] get-tuple-element((s32[], u32[2]{0}, u32[2]{0}, u32[], u32[], u32[], u32[4]{0}, u32[4]{0}) %parameter.2), index=0
  %constant.295 = s32[] constant(5), metadata={op_type="while" op_name="while[ body_nconsts=0\n       cond_nconsts=0 ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  ROOT %compare.13 = pred[] compare(s32[] %get-tuple-element.467, s32[] %constant.295), direction=LT, type=UNSIGNED, metadata={op_type="lt" op_name="while/cond/lt" source_file="jax/jax_test_conv2d.py" source_line=33}
}

%fused_computation.4.clone (param_0.91: u32[], param_1.135: u32[4], param_2.119: u32[2304], param_3.121: u32[2304], param_4.161: s32[]) -> u32[2304] {
  %param_3.121 = u32[2304]{0} parameter(3)
  %param_2.119 = u32[2304]{0} parameter(2)
  %add.247 = u32[2304]{0} add(u32[2304]{0} %param_3.121, u32[2304]{0} %param_2.119), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %param_1.135 = u32[4]{0} parameter(1)
  %slice.149 = u32[1]{0} slice(u32[4]{0} %param_1.135), slice={[0:1]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(1,)\n                  start_indices=(0,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.180 = u32[] reshape(u32[1]{0} %slice.149), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.361 = u32[2304]{0} broadcast(u32[] %reshape.180), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.45 = u32[2304]{0} shift-left(u32[2304]{0} %param_2.119, u32[2304]{0} %broadcast.361), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %constant.669 = u32[] constant(32), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.67 = u32[] subtract(u32[] %constant.669, u32[] %reshape.180), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.360 = u32[2304]{0} broadcast(u32[] %subtract.67), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.55 = u32[2304]{0} shift-right-logical(u32[2304]{0} %param_2.119, u32[2304]{0} %broadcast.360), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.54 = u32[2304]{0} or(u32[2304]{0} %shift-left.45, u32[2304]{0} %shift-right-logical.55), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.82 = u32[2304]{0} xor(u32[2304]{0} %add.247, u32[2304]{0} %or.54), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.248 = u32[2304]{0} add(u32[2304]{0} %add.247, u32[2304]{0} %xor.82), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.148 = u32[1]{0} slice(u32[4]{0} %param_1.135), slice={[1:2]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(2,)\n                  start_indices=(1,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.178 = u32[] reshape(u32[1]{0} %slice.148), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.362 = u32[2304]{0} broadcast(u32[] %reshape.178), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.46 = u32[2304]{0} shift-left(u32[2304]{0} %xor.82, u32[2304]{0} %broadcast.362), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.66 = u32[] subtract(u32[] %constant.669, u32[] %reshape.178), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.358 = u32[2304]{0} broadcast(u32[] %subtract.66), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.56 = u32[2304]{0} shift-right-logical(u32[2304]{0} %xor.82, u32[2304]{0} %broadcast.358), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.56 = u32[2304]{0} or(u32[2304]{0} %shift-left.46, u32[2304]{0} %shift-right-logical.56), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.83 = u32[2304]{0} xor(u32[2304]{0} %add.248, u32[2304]{0} %or.56), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.249 = u32[2304]{0} add(u32[2304]{0} %add.248, u32[2304]{0} %xor.83), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.147 = u32[1]{0} slice(u32[4]{0} %param_1.135), slice={[2:3]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(3,)\n                  start_indices=(2,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.176 = u32[] reshape(u32[1]{0} %slice.147), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.364 = u32[2304]{0} broadcast(u32[] %reshape.176), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.47 = u32[2304]{0} shift-left(u32[2304]{0} %xor.83, u32[2304]{0} %broadcast.364), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.65 = u32[] subtract(u32[] %constant.669, u32[] %reshape.176), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.357 = u32[2304]{0} broadcast(u32[] %subtract.65), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.57 = u32[2304]{0} shift-right-logical(u32[2304]{0} %xor.83, u32[2304]{0} %broadcast.357), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.57 = u32[2304]{0} or(u32[2304]{0} %shift-left.47, u32[2304]{0} %shift-right-logical.57), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
  %xor.84 = u32[2304]{0} xor(u32[2304]{0} %add.249, u32[2304]{0} %or.57), metadata={op_type="xor" op_name="while/body/xor" source_file="jax/jax_test_conv2d.py" source_line=33}
  %add.250 = u32[2304]{0} add(u32[2304]{0} %add.249, u32[2304]{0} %xor.84), metadata={op_type="add" op_name="while/body/add" source_file="jax/jax_test_conv2d.py" source_line=33}
  %slice.146 = u32[1]{0} slice(u32[4]{0} %param_1.135), slice={[3:4]}, metadata={op_type="slice" op_name="while/body/slice[ limit_indices=(4,)\n                  start_indices=(3,)\n                  strides=(1,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %reshape.174 = u32[] reshape(u32[1]{0} %slice.146), metadata={op_type="squeeze" op_name="while/body/squeeze[ dimensions=(0,) ]" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.365 = u32[2304]{0} broadcast(u32[] %reshape.174), dimensions={}, metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-left.48 = u32[2304]{0} shift-left(u32[2304]{0} %xor.84, u32[2304]{0} %broadcast.365), metadata={op_type="shift_left" op_name="while/body/shift_left" source_file="jax/jax_test_conv2d.py" source_line=33}
  %subtract.64 = u32[] subtract(u32[] %constant.669, u32[] %reshape.174), metadata={op_type="sub" op_name="while/body/sub" source_file="jax/jax_test_conv2d.py" source_line=33}
  %broadcast.356 = u32[2304]{0} broadcast(u32[] %subtract.64), dimensions={}, metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %shift-right-logical.58 = u32[2304]{0} shift-right-logical(u32[2304]{0} %xor.84, u32[2304]{0} %broadcast.356), metadata={op_type="shift_right_logical" op_name="while/body/shift_right_logical" source_file="jax/jax_test_conv2d.py" source_line=33}
  %or.58 = u32[2304]{0} or(u32[2304]{0} %shift-left.48, u32[2304]{0} %shift-right-logical.58), metadata={op_type="or" op_name="while/body/or" source_file="jax/jax_test_conv2d.py" source_line=33}
